#include <stdio.h>
#include <stdlib.h>

int main()
{
    int n;
    scanf("%d", &n);

    int area[n][n];
    for(int i=0; i<n; i++){
        for(int ii=0; ii<n; ii++){
            scanf("%d", &area[i][ii]);
        }
    }

    int mount=0, count=0, peak=0;
    for(int i=1; i<n-1; i++){                                       //LOOP i    ทำหน้าที่เป็นแถวข้างใน โดยเริ่มจาก i=1 และจบที่ไม่เกิน n-1 (เช่นมี array 0 ถึง 4 แถว จะเริ่มจากแถวที่ 1 ไปจบที่ 3)
        for(int ii=1; ii<n-1; ii++){                                //LOOP ii   ทำหน้าที่เป็นหลักข้างใน โดยเริ่มจาก i=1 และจบที่ไม่เกิน n-1 (เช่นมี array 0 ถึง 4 แถว จะเริ่มจากหลักที่ 1 ไปจบที่ 3)
            for(int iii=i-1; iii<=i+1; iii++){                      //LOOP iii  ทำหน้าที่เป็นแถวของบริเวณยอดเขาที่เลือก 3 แถว โดยเริ่มจาก iii = i-1 และจบที่ i+1 (เช่นถ้า i = 1 จะเริ่มจาก 0 ไปจบที่ 2)
                for(int iv=ii-1; iv<=ii+1; iv++){                   //LOOP iv   ทำหน้าที่เป็นหลักของบริเวณยอดเขาที่เลือก 3 หลัก โดยเริ่มจาก iv = ii-1 และจบที่ ii+1 (เช่นถ้า ii = 1 จะเริ่มจาก 0 ไปจบที่ 2)
                    if(area[i][ii] > area[iii][iv]){
                        count++;                                    //ทำการเช็คพื้นที่ทั้ง 9 ช่อง ถ้าหากมีช่องใดน้อยกว่าตรงกลางก็จะ count + 1
                    }
                }
            }
            if(count == 8){                                         //เมื่อเช็คครบแล้ว แล้วไม่มีช่องใดมากกว่าตรงกลาง (ยกเว้น ตัวมันเอง) จะได้ count = 8
                peak++;                                             //จากนั้นก็ให้นับจำนวนยอดเขา peak + 1
            }
            count=0;                                                //อย่าลืม รีเซ็ต count ให้เป็น 0 เหมือนเดิมเพื่อเอาไปนับพื้นที่ยอดเขาใหม่
        }
    }

    printf("%d", peak);                                             //OUTPUT จำนวนยอดเขาที่ได้ออกมาก่อน

    for(int i=1; i<n-1; i++){                                       //
        for(int ii=1; ii<n-1; ii++){                                //
            for(int iii=i-1; iii<=i+1; iii++){                      //
                for(int iv=ii-1; iv<=ii+1; iv++){                   // ทำเหมือนเดิม เพื่อหาจำนวน count
                    if(area[i][ii] > area[iii][iv]){                //
                        count++;                                    //
                    }                                               //
                }
            }
            if(count == 8){                                         //เมื่อ count = 8 แล้ว ให้ print ความสูงยอดเขานั้น และพิกัดแถวและหลักของยอดเขานั้น
                printf("\n%d %d %d", area[i][ii], i, ii);
            }
            count=0;
        }
    }
    return 0;
}
